Database Programming in Python & SQLite

@Authors: Sridhar Nerur, Samuel Jayarajan, and Mahyar Vagehfi

In this notebook, we show you how to use a built-in database API module called sqlite3. It provides direct access to database tables/files through functions available in a SQLite. A database is a collection of related tables. Tables are also referred to as relations. Each table, in turn, will consist of related fields or attributes. For example, we may have a table called "Customers", which would have fields such as customer_id, last_name, first_name, and address. This tutorial assumes that you know the basics of databases - tables, normalization, primary and foreign keys, and so forth.

The first thing we do is to connect to an existing database or one that we wish to create. We will create a database called "movie_app.db" and then use SQL (Structured Query Language) to create and populate tables in the database. We will also show you how to use SQL, a declarative language, to query the database. This tutorial will not get into the details of SQL. If you wish to learn more about SQL - something we would highly recommend - you may go to https://www.w3schools.com/sql/ for a nice tutorial. 

Let us get started.....

In [1]:
import sqlite3
connection = sqlite3.connect("movie_app.db")

The connect function will connect to a database if one exists, otherwise it creates a new one. Now that we have a connection, we need to use it to obtain a cursor object that will allow us to execute SQL commands.

In [2]:
cursor = connection.cursor()

We will create the following tables:

1. Members - contains information about members who rent movies. Fields (attributes) will include member_id (integer), name (text), and address (text).
2. Movies - contains information about the movies that members can rent. Fields included are movie_id (integer), title (text), genre (text), and  rating (text). One could include other fields such as year, director, hero, heroine, and so forth. However, we will keep it very simple.
3. Ratings - contains ratings that members have given to movies. Fields would be member_id, movie_id, and rating (integer).

In [3]:
#Query to create table called Members
query = """CREATE TABLE members 
           (member_id int,
            name text,
            address text)"""
#let us execute the query using the cursor
cursor.execute(query)

In [4]:
#let us insert one record -- each row in a table is called a record
query = """INSERT INTO members (member_id, name, address)
        VALUES (1, "Doug Walters", "102 Brisbane Ave, Sydney")"""
#NOTE THAT SQL IS NOT CASE SENSITIVE
cursor.execute(query)

In [5]:
#Let us check the table to see if the record was entered
#We use a command called SELECT to do this
query = "SELECT * from members"
cursor.execute(query)

The Select statement is very simple.

Select * from members --> displays all columns/fields
Select name, address from members --> display only names and addresses

Where is the output? Well, we need to fetch it from the cursor using fetchone (for one record) or fetchall.

In [6]:
cursor.fetchone()

(1, 'Doug Walters', '102 Brisbane Ave, Sydney')

In [10]:
#Adding mutliple records
query = """INSERT INTO members (member_id, name, address)
           VALUES
           (2, 'Viv Richards', '1111 Antigua Bay, Dallas'),
           (3, 'Andy Roberts', '12211 Hemlock Street, Overland Park')"""
cursor.execute(query)
#Check the table to see if the records are there
cursor.execute("Select * from members")
cursor.fetchall()

[(1, 'Doug Walters', '102 Brisbane Ave, Sydney'),
 (2, 'Viv Richards', '1111 Antigua Bay, Dallas'),
 (3, 'Andy Roberts', '12211 Hemlock Street, Overland Park')]

Note that results are returned as a list of tuples. Let us explore some more ways of inserting records.

In [12]:
record = (4, "VVS Laxman", "123 Park Lane, Hyderabad")
query = """INSERT INTO members VALUES (?, ?, ?)"""
cursor.execute(query, record)
cursor.execute("select * from members")
cursor.fetchall()

[(1, 'Doug Walters', '102 Brisbane Ave, Sydney'),
 (2, 'Viv Richards', '1111 Antigua Bay, Dallas'),
 (3, 'Andy Roberts', '12211 Hemlock Street, Overland Park'),
 (4, 'VVS Laxman', '123 Park Lane, Hyderabad')]

In [14]:
#How about multiple records at once
records = [(5, "Michael Holding", "101 South Oak St, Arlington"),
           (6, "Garry Sobers", "121 Greatest Ave, Melbourne")]
query = """INSERT INTO members VALUES (?, ?, ?)"""
for record in records:
    cursor.execute(query, record)
cursor.execute("select * from members")
cursor.fetchall()

[(1, 'Doug Walters', '102 Brisbane Ave, Sydney'),
 (2, 'Viv Richards', '1111 Antigua Bay, Dallas'),
 (3, 'Andy Roberts', '12211 Hemlock Street, Overland Park'),
 (4, 'VVS Laxman', '123 Park Lane, Hyderabad'),
 (5, 'Michael Holding', '101 South Oak St, Arlington'),
 (6, 'Garry Sobers', '121 Greatest Ave, Melbourne')]

Let us create a movies table and populate it. After that, we will do the same for a ratings table.

In [15]:
query = """CREATE TABLE Movies
           (movie_id int,
            title text,
            genre text,
            rating text)"""
cursor.execute(query)

In [16]:
records = [(1, "The Jungle Book", "Adventure", "G" ),
           (2, "Enter the Dragon", "Action", "R"),
           (3, "The Scent of a Woman", "Drama", "R"),
           (4, "For a Few Dollar More", "Western", "R"),
           (5, "The Godfather", "Drama", "R"),
           (6, "Jurassic Park", "Adventure", "PG-13"),
           (7, "The Black Panther", "Action", "R"),
           (8, "The Pink Panther", "Comedy", "PG-13")]
query = """INSERT INTO Movies VALUES (?, ?, ?, ?)"""
for record in records:
    cursor.execute(query, record)
cursor.execute("Select * from movies")
cursor.fetchall()

[(1, 'The Jungle Book', 'Adventure', 'G'),
 (2, 'Enter the Dragon', 'Action', 'R'),
 (3, 'The Scent of a Woman', 'Drama', 'R'),
 (4, 'For a Few Dollar More', 'Western', 'R'),
 (5, 'The Godfather', 'Drama', 'R'),
 (6, 'Jurassic Park', 'Adventure', 'PG-13'),
 (7, 'The Black Panther', 'Action', 'R'),
 (8, 'The Pink Panther', 'Comedy', 'PG-13')]

In [17]:
#Let us create a movie review table called Ratings
query = """CREATE TABLE Ratings
           (member_id int,
            movie_id int,
            movie_rating int)"""
cursor.execute(query)

In [18]:
#Records to be inserted
records = [(1, 1, 3), (2, 1, 5), (4, 1, 4), (1, 2, 5), (1, 4, 2),
          (1, 6, 5), (2, 5, 4), (2, 3, 3), (2, 2, 3), (3, 1, 4),
          (3, 3, 5), (3, 4, 2), (3, 5, 5), (4, 1, 4), (4, 2, 3),
          (4, 5, 4), (4, 6, 5), (5, 5, 3), (5, 1, 3), (5, 2, 4),
          (5, 4, 3), (5, 6, 4), (6, 6, 5), (6, 1, 4), (6, 2, 3),
          (6, 3, 4)]
query = """INSERT INTO Ratings VALUES (?, ?, ?)"""
for record in records:
    cursor.execute(query, record)
cursor.execute("select * from ratings")
cursor.fetchall()

[(1, 1, 3),
 (2, 1, 5),
 (4, 1, 4),
 (1, 2, 5),
 (1, 4, 2),
 (1, 6, 5),
 (2, 5, 4),
 (2, 3, 3),
 (2, 2, 3),
 (3, 1, 4),
 (3, 3, 5),
 (3, 4, 2),
 (3, 5, 5),
 (4, 1, 4),
 (4, 2, 3),
 (4, 5, 4),
 (4, 6, 5),
 (5, 5, 3),
 (5, 1, 3),
 (5, 2, 4),
 (5, 4, 3),
 (5, 6, 4),
 (6, 6, 5),
 (6, 1, 4),
 (6, 2, 3),
 (6, 3, 4)]

In [30]:
#there is yet another way to add multiple records...
#we will use cursor.executemany
records = [(1, 7, 3), (1, 8, 5), (2, 7, 5), (2, 8, 2), (4, 7, 4),
          (4, 8, 5), (6, 8, 4)]
query = "INSERT INTO ratings VALUES (?, ?, ?)"
cursor.executemany(query, records)

#let us look limit select to 5 records
cursor.execute("select * from ratings limit 5")
cursor.fetchall()

[(1, 1, 3), (2, 1, 5), (4, 1, 4), (1, 2, 5), (1, 4, 2)]

In [20]:
#What is the name and address of the member whose id is 3?
cursor.execute("select name, address from members where member_id = 3")
cursor.fetchone()

('Andy Roberts', '12211 Hemlock Street, Overland Park')

The previous query used a "where" clause to test for a condition. You can use boolean operators such as "and" and "or" in the where clause.

In [21]:
#Display the names and addresses of members sorted in ascending
#order by name. We will use the ORDER BY clause for this.
query = "select name, address from members order by name"
cursor.execute(query)
cursor.fetchall()

[('Andy Roberts', '12211 Hemlock Street, Overland Park'),
 ('Doug Walters', '102 Brisbane Ave, Sydney'),
 ('Garry Sobers', '121 Greatest Ave, Melbourne'),
 ('Michael Holding', '101 South Oak St, Arlington'),
 ('VVS Laxman', '123 Park Lane, Hyderabad'),
 ('Viv Richards', '1111 Antigua Bay, Dallas')]

In [22]:
#Same as above, but sorted in descending order by name
query = "select name, address from members order by name desc"
cursor.execute(query)
cursor.fetchall()

[('Viv Richards', '1111 Antigua Bay, Dallas'),
 ('VVS Laxman', '123 Park Lane, Hyderabad'),
 ('Michael Holding', '101 South Oak St, Arlington'),
 ('Garry Sobers', '121 Greatest Ave, Melbourne'),
 ('Doug Walters', '102 Brisbane Ave, Sydney'),
 ('Andy Roberts', '12211 Hemlock Street, Overland Park')]

In [23]:
#What is the average rating per movie?
query = """select movie_id, avg(movie_rating)
           from ratings
           group by movie_id"""
cursor.execute(query)
cursor.fetchall()

[(1, 3.857142857142857),
 (2, 3.6),
 (3, 4.0),
 (4, 2.3333333333333335),
 (5, 4.0),
 (6, 4.75)]

We need to take care of a couple of things. First, the average should be rounded to two decimal places. Second, it would be nice to see the name of the movie as well.

In [26]:
#Same as the previous cell, but rounded to 2 decimal places
query = """select movie_id, round(avg(movie_rating), 2)
           from ratings
           group by movie_id"""
cursor.execute(query)
cursor.fetchall()

[(1, 3.86), (2, 3.6), (3, 4.0), (4, 2.33), (5, 4.0), (6, 4.75)]

To display the name of the movie, we will have to use the movie id from the ratings table to get the title from the movies table. We can do it as follows. We will be performing a "join" of two tables.

In [28]:
query = """select r.movie_id, m.title, round(avg(movie_rating), 2)
           from ratings r, movies m
           where r.movie_id = m.movie_id
           group by r.movie_id"""
cursor.execute(query)
cursor.fetchall()

[(1, 'The Jungle Book', 3.86),
 (2, 'Enter the Dragon', 3.6),
 (3, 'The Scent of a Woman', 4.0),
 (4, 'For a Few Dollar More', 2.33),
 (5, 'The Godfather', 4.0),
 (6, 'Jurassic Park', 4.75)]

In [34]:
#Let us also display the member_name to see what ratings were
#given by members
query = """select r.movie_id, c.name, m.title, movie_rating
           from ratings r, movies m, members c
           where 
           r.movie_id = m.movie_id
           and
           r.member_id = c.member_id
           """
cursor.execute(query)
cursor.fetchall()

[(1, 'Doug Walters', 'The Jungle Book', 3),
 (1, 'Viv Richards', 'The Jungle Book', 5),
 (1, 'VVS Laxman', 'The Jungle Book', 4),
 (2, 'Doug Walters', 'Enter the Dragon', 5),
 (4, 'Doug Walters', 'For a Few Dollar More', 2),
 (6, 'Doug Walters', 'Jurassic Park', 5),
 (5, 'Viv Richards', 'The Godfather', 4),
 (3, 'Viv Richards', 'The Scent of a Woman', 3),
 (2, 'Viv Richards', 'Enter the Dragon', 3),
 (1, 'Andy Roberts', 'The Jungle Book', 4),
 (3, 'Andy Roberts', 'The Scent of a Woman', 5),
 (4, 'Andy Roberts', 'For a Few Dollar More', 2),
 (5, 'Andy Roberts', 'The Godfather', 5),
 (1, 'VVS Laxman', 'The Jungle Book', 4),
 (2, 'VVS Laxman', 'Enter the Dragon', 3),
 (5, 'VVS Laxman', 'The Godfather', 4),
 (6, 'VVS Laxman', 'Jurassic Park', 5),
 (5, 'Michael Holding', 'The Godfather', 3),
 (1, 'Michael Holding', 'The Jungle Book', 3),
 (2, 'Michael Holding', 'Enter the Dragon', 4),
 (4, 'Michael Holding', 'For a Few Dollar More', 3),
 (6, 'Michael Holding', 'Jurassic Park', 4),
 (6, 'Garry Sobers', 'Jurassic Park', 5),
 (1, 'Garry Sobers', 'The Jungle Book', 4),
 (2, 'Garry Sobers', 'Enter the Dragon', 3),
 (3, 'Garry Sobers', 'The Scent of a Woman', 4),
 (7, 'Doug Walters', 'The Black Panther', 3),
 (8, 'Doug Walters', 'The Pink Panther', 5),
 (7, 'Viv Richards', 'The Black Panther', 5),
 (8, 'Viv Richards', 'The Pink Panther', 2),
 (7, 'VVS Laxman', 'The Black Panther', 4),
 (8, 'VVS Laxman', 'The Pink Panther', 5),
 (8, 'Garry Sobers', 'The Pink Panther', 4)]

In the last two queries shown above, we have used aliases for the table names to make it easy to access fields within them. For example, we have used r as an alias for ratings and m for movies. Since these tables share some common fields (e.g., member_id, movie_id) to link the tables, we cannot say "select member_id from movies, ratings where movies.member_id = ratings.member_id", as we are not sure which member_id should be displayed. However, "select members.member_id from movies, ratings where movies.member_id = ratings.member_id" makes it clear that we wish to display member_id from members. We can make it shorter by aliasing members and ratings as shown below:

"select m.member_id from movies m, ratings r where m.member_id = r.member_id"

Finally, you must commit your changes using connection.commit() and then close the connection (connection.close()). Before we do that, let us use Pandas to access the database.

What we have covered here is just a fraction of what you can do with SQLite3. Obviously, you can alter tables, delete records (using the where clause), drop the database and/or tables, update records, and so forth. You are encouraged to build on the basic commands taught in this notebook.

In [36]:
#Simple example using Pandas
import pandas.io.sql as sql
#Let us try the previous example
query = """select r.movie_id, c.name, m.title, movie_rating
           from ratings r, movies m, members c
           where 
           r.movie_id = m.movie_id
           and
           r.member_id = c.member_id
           """
dataframe = sql.read_sql(query, connection)
dataframe.head()

   movie_id          name                  title  movie_rating
0         1  Doug Walters        The Jungle Book             3
1         1  Viv Richards        The Jungle Book             5
2         1    VVS Laxman        The Jungle Book             4
3         2  Doug Walters       Enter the Dragon             5
4         4  Doug Walters  For a Few Dollar More             2

In [37]:
connection.commit()
connection.close()